In [2]:
import pandas as pd

In [3]:
URL = "https://raw.githubusercontent.com/sojog/Python-ADR-22-23-ianuarie-2026/refs/heads/main/Ziua2/clwin.csv"

In [4]:
# 1. Importați fișierul CSV folosind Pandas și afișați primele 5 rânduri. 
df = pd.read_csv(URL, index_col=0)
df.head()

    country        team  trophies
id
0   England   Liverpool       6.0
1     Spain   Barcelona       5.0
2   England  Man United       3.0
3     Italy       Inter       3.0
4   England     Chelsea       2.0

In [5]:
# 2. Afișați tipurile de date ale fiecărei coloane. 
df.dtypes

country      object
team         object
trophies    float64
dtype: object

In [6]:
# 3. Obțineți statisticile rezumate ale coloanelor numerice din date. 
statistics = df.describe()
statistics

        trophies
count  19.000000
mean    2.000000
std     1.414214
min     1.000000
25%     1.000000
50%     2.000000
75%     2.000000
max     6.000000

In [7]:
type(statistics)

pandas.core.frame.DataFrame

In [8]:
None

In [9]:
# 4. Verificați dacă există valori lipsă în setul de date. 
df.isnull().sum()

country     0
team        0
trophies    1
dtype: int64

In [19]:
# 5. Redenumiți coloana „echipă” în „club”. 
df = df.rename(
    columns = {"team" : "club"}
)
df.head(2)

    country       club  wins
id
0   England  Liverpool   6.0
1     Spain  Barcelona   5.0

In [22]:
df.rename(
    columns = {"trophies" : "wins"}, inplace=True
)
df.head()

    country        club  wins
id
0   England   Liverpool   6.0
1     Spain   Barcelona   5.0
2   England  Man United   3.0
3     Italy       Inter   3.0
4   England     Chelsea   2.0

In [23]:
# 6. Selectați și afișați coloanele „echipă” și „trofee”.
df[  ["club", "wins"]  ]

             club  wins
id
0       Liverpool   6.0
1       Barcelona   5.0
2      Man United   3.0
3           Inter   3.0
4         Chelsea   2.0
5         Chelsea   2.0
6    Nottm Forest   2.0
7         Benfica   2.0
8        Juventus   2.0
9        FC Porto   2.0
10       Man City   1.0
11       Dortmund   1.0
12      Feyenoord   1.0
13      Marseille   1.0
14    Aston Villa   1.0
15        Hamburg   1.0
16  Crvena zvezda   1.0
17           FCSB   NaN
18            PSV   1.0
19         Celtic   1.0

In [25]:
# 7. Selectați rândurile în care țara este „Anglia”. 
is_england = df["country"] == "England"
df[is_england]

    country          club  wins
id
0   England     Liverpool   6.0
2   England    Man United   3.0
4   England       Chelsea   2.0
5   England       Chelsea   2.0
6   England  Nottm Forest   2.0
10  England      Man City   1.0
14  England   Aston Villa   1.0